In [1]:
from pandas import DataFrame

In [2]:
dframe = DataFrame({'city':['alma','brian head','fox park'],
                                     'altitude':[3158,3000,2752]})

In [3]:
dframe

         city  altitude
0        alma      3158
1  brian head      3000
2    fox park      2752

In [7]:
state_map={'alma':'colorado', 'brian head':'utah', 'fox park':'wyoming'}

In [8]:
dframe['state'] = dframe['city'].map(state_map)

In [9]:
dframe

         city  altitude     state
0        alma      3158  colorado
1  brian head      3000      utah
2    fox park      2752   wyoming

In [10]:
dframe['key1'] = [0,1,2]

In [11]:
dframe

         city  altitude     state  key1
0        alma      3158  colorado     0
1  brian head      3000      utah     1
2    fox park      2752   wyoming     2